const qnaList = [
    {
      q: '1. 어떤 장소를 원하시나요?',
      a: [
        { answer: 'a. 한 끼 든든히 채울 수 있는 장소.', type: [0] },
        { answer: 'b. 간단하게 음료를 즐길 수 있는 장소.', type: [1] },
        { answer: 'c. 빵을 전문으로 하는 장소', type: [2] },
      ]
    },
    {
      q: '2. 지금 당장! 이 나라의 음식을 먹겠다면 어느 곳을 선택하시겠습니까 ',
      a: [
        { answer: 'a. 한국', type: [0] },
        { answer: 'b. 일본, 중국', type: [1] },
        { answer: 'c. 인도', type: [2] },
        { answer: 'd. 남미', type: [3] },
        { answer: 'e. 중동', type: [4] },
        { answer: 'f. 서양', type: [5] },
        { answer: 'g. 상관없다.', type: [6] },
      ]
    },
    {
      q: '3. 채식을 전문으로 하는 곳을 찾아볼까요?',
      a: [
        { answer: 'a. 네. 좋아요', type: [1] },
        { answer: 'b. 아니요....아직은 부담스러워요..', type: [0] },
      ]
    },
    {
      q: '4. 오늘은 멀리 떠나고 싶은 날인가요?',
      a: [
        { answer: 'a. 네. 오늘은 먼 곳도 상관없을 것 같아요.',type : [0] },
        { answer: 'b. 아니요. 최대한 가까운 곳으로 찾아주세요.', type : [1] },
      ]
    }
  ]
  
